package main

/*func main() {
	//создаем слайс и заполняем его
	sl := []float32{-25.4, -27.6, 13.5, 19.1, 15.5, 24.5, -21.9, 32.5, 6.5, -8.2}
	//создаем мапу
	temperature := make(map[int][]float32)
	//проходим по массиву и группируем все в мапу
	for _, val := range sl {
		//ключ мапы = алгоритм такой конвертируем float в int после нацело делим на 10, и умножаем на шаг
		//значение это слайс туда мы добавляем новое значение по мере движения по циклу
		temperature[(int(val)/10)*10] = append(temperature[(int(val)/10)*10], val)
	}
	//вывод всего что у нас в мапе
	fmt.Println(temperature)
}*/
